backend/app/controllers/api/v1/articles_controller.rb

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
---
      def show
        article = Article.find(params[:id])